Revit 2027 API
ExportLayerInfo.AddLayerModifier Method
 Adds a project layer modifier to the layer info.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddLayerModifier(
	LayerModifier layerModifier
)
Public Sub AddLayerModifier (
	layerModifier As LayerModifier
)
public:
void AddLayerModifier(
	LayerModifier^ layerModifier
)
member AddLayerModifier :
        layerModifier : LayerModifier -> unit
Parameters
layerModifier LayerModifier
 The project layer modifier.
Exceptions
Exception | Condition
ArgumentException |  The separator string contains one or more prohibited characters. -or- The modifier type already exists in the layer info.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLayerInfo Class
Autodesk.Revit.DB Namespace